CREATE DATABASE hhdb;
GO

USE hhdb;
CREATE TABLE COMPANIES
(
    ID                      INT PRIMARY KEY IDENTITY,
    COMPANY_NAME            TEXT NOT NULL,
    INN                     BIGINT UNIQUE,
    REGISTRATION_ADDRESS    TEXT NOT NULL,
    OPERATIONAL_ADDRESS     TEXT NOT NULL
)
CREATE TABLE EMPLOYEES
(
    ID              INT PRIMARY KEY IDENTITY,
    FIRST_NAME      TEXT NOT NULL,
    MIDDLE_NAME     TEXT NULL,
    SURNAME         TEXT NOT NULL,
    BIRTH_DATE      DATE NOT NULL,
    PASSPORT_SERIES INT,
    PASSPORT_NUMBER INT,
    UNIQUE(PASSPORT_SERIES, PASSPORT_NUMBER),
    COMPANY_ID      INT REFERENCES COMPANIES (ID)
)

INSERT INTO COMPANIES VALUES
('ООО "Рога Копыта"', 9729219090, '107200 г.Москва ул.Тверская д.1', '107250 г.Москва ул.Пушкинская д.2'),
('ООО "Копыта Рога"', 9729219095, '107200 г.Москва ул.Уральская д.3', '107250 г.Москва ул.Байкальская д.7'),
('ЗАО "Лабеан"', 9729219097, '107200 г.Москва ул.Римского-Корсакого д.16', '107250 г.Москва ул.Ломоносова д.23'),
('ФГУП "Сапог"', 9729219026, '107200 г.Москва ул.1-ая Парковая д.107', '107250 г.Москва ул.Дмитровская д.11'),
('ОАО "Вектор"', 9729219029, '107200 г.Москва ул.Руссаковская д.18', '107250 г.Москва ул.Гончаренко д.25'),
('ООО "ААА"', 9729219030, '107200 г.Москва ул.Уссурийская д.46', '107250 г.Москва ул.Измайловская д.235')

INSERT INTO EMPLOYEES VALUES
('Дмитрий', 'Дмитриевич', 'Дмитриев', '2001-04-12', 4255, 112733, 1),
('Петр', 'Петрович', 'Петров', '1999-02-01', 4455, 111233, 1),
('Сидор', 'Сидорович', 'Сидоров', '1988-04-06', 4355, 112833, 1),
('Иван', NULL, 'Незнающий', '1979-02-02', 4445, 112433, 2),
('Эдуард', 'Эдуардович', 'Эдуардов', '1995-06-04', 4655, 11233, 3),
('Алексей', 'Алексеевич', 'Алексеев', '1978-01-08', 4755, 176233, 4),
('Александра', 'Александровна', 'Александрова', '0001-09-02', 1255, 152233, 5),
('Василий', 'Васильевич', 'Васильев', '2001-02-03', 1355, 142233, 5),
('Евгений', 'Евгеньевич', 'Евгеньев', '1991-05-07', 4445, 132233, 6),
('Максим', 'Максимович', 'Максаков', '1995-02-06', 4475, 122233, 2)